:DOC-CONFIG:
#+startup: fold
#+title: Direnv caching
#+author: Venky Iyer
#+email: indigoviolet@gmail.com
:END:

This is an implementation of caching for [[https://direnv.net/][direnv]].

~direnv-cache~ caches the environment into a ~.env~ file using ~direnv~ (and then
loads the ~.env~ using direnv itself).

It supports rebuilds when [[*Cache validity][the cache becomes invalid]].

** Rough model of how direnv works

1. ~direnv hook <shell>~ sets up ~direnv export json~ to be called on each prompt
   (~precmd~) and directory change (~chpwd~)
2. upon ~chwpd~, if we are /entering/ a directory containing an ~envrc~, we execute it
   in a subshell, compare the env from the subshell to our own, and then apply
   that diff to our env. (/loading/).
3. Note that the env in the subshell that ~direnv export json~ is executed in, is
   carefully restored to the "pre-direnv" state, by reverting ~DIRENV_DIFF~.
4. Several direnv-specific state tracking env variables are set - ex.
   ~DIRENV_FILE~ (the envrc file), ~DIRENV_DIR~ (the directory containing the
   envrc), ~DIRENV_WATCHES~ (name, mtime, existence of all watched files),
   ~DIRENV_DIFF~ (the diff that was applied).
5. Upon ~chwpd~, if we already have these variables in our environment, and are
   leaving the ~DIRENV_DIR~, these tracking variables are unset, and the inverse
   of ~DIRENV_DIFF~ is applied. (/unloading/)
6. Upon ~precmd~, if ~DIRENV_WATCHES~ is /stale/ i.e, the watched files have changed,
   direnv loads again (~direnv current~ implements this for one file at a time).
7. ~direnv watch~ and friends add to ~DIRENV_WATCHES~, so they act as dependencies
   for the env state.

#+begin_src bash :results output
direnv hook zsh
#+end_src

#+RESULTS:
#+begin_example

_direnv_hook() {
  trap -- '' SIGINT;
  eval "$("/home/linuxbrew/.linuxbrew/Cellar/direnv/2.30.3/bin/direnv" export zsh)";
  trap - SIGINT;
}
typeset -ag precmd_functions;
if [[ -z "${precmd_functions[(r)_direnv_hook]+1}" ]]; then
  precmd_functions=( _direnv_hook ${precmd_functions[@]} )
fi
typeset -ag chpwd_functions;
if [[ -z "${chpwd_functions[(r)_direnv_hook]+1}" ]]; then
  chpwd_functions=( _direnv_hook ${chpwd_functions[@]} )
fi
#+end_example

**** Create directories

#+name: dir-vars
#+begin_src bash
WITH_CACHE_DIR=/tmp/with_cache WITHOUT_CACHE_DIR=/tmp/without_cache
#+end_src

#+RESULTS: dir-vars

#+begin_src bash :results output :include dir-vars :prologue "exec 2>&1"
rm $WITH_CACHE_DIR $WITHOUT_CACHE_DIR -rf
mkdir $WITH_CACHE_DIR $WITHOUT_CACHE_DIR
ln -sf $(realpath pyproject.toml) $WITH_CACHE_DIR/
ln -sf $(realpath tool-versions) $WITH_CACHE_DIR/
( cd $WITH_CACHE_DIR && poetry install )
ln -sf $(realpath envrc_with_cache) $WITH_CACHE_DIR/.envrc
direnv allow $WITH_CACHE_DIR/.envrc

ln -sf $(realpath pyproject.toml) $WITHOUT_CACHE_DIR/
ln -sf $(realpath tool-versions) $WITHOUT_CACHE_DIR/
( cd $WITHOUT_CACHE_DIR && poetry install )
ln -sf $(realpath envrc_without_cache) $WITHOUT_CACHE_DIR/.envrc
direnv allow $WITHOUT_CACHE_DIR/.envrc
:
#+end_src

#+RESULTS:
#+begin_example
Creating virtualenv direnv-cache-test in /tmp/with_cache/.venv
Updating dependencies
Resolving dependencies...

Writing lock file
Creating virtualenv direnv-cache-test in /tmp/without_cache/.venv
Updating dependencies
Resolving dependencies...

Writing lock file
#+end_example


***** ensure cache
#+begin_src bash :results output :prologue "exec 2>&1" :include dir-vars
export DIRENV_CACHE_DEBUG=1
direnv exec "$WITH_CACHE_DIR" bash -c "ls $WITH_CACHE_DIR/.env -al"
:
#+end_src

#+RESULTS:
: direnv: loading /tmp/with_cache/.envrc
: Loaded from cache /tmp/with_cache/.env (status: 0)
: -rw-rw-r-- 1 venky venky 1317 Mar 19 15:49 /tmp/with_cache/.env


***** measure
#+begin_src bash :results output :include dir-vars
hyperfine -w 10 -L dir "$WITH_CACHE_DIR","$WITHOUT_CACHE_DIR" 'cd {dir}'
#+end_src

#+RESULTS:
#+begin_example
Benchmark 1: cd /tmp/with_cache
  Time (mean ± σ):       0.0 ms ±   0.1 ms    [User: 0.1 ms, System: 0.1 ms]
  Range (min … max):     0.0 ms …   1.5 ms    3353 runs

Benchmark 2: cd /tmp/without_cache
  Time (mean ± σ):       0.1 ms ±   0.1 ms    [User: 0.1 ms, System: 0.1 ms]
  Range (min … max):     0.0 ms …   4.6 ms    3140 runs

Summary
  'cd /tmp/with_cache' ran
    1.13 ± 3.65 times faster than 'cd /tmp/without_cache'
#+end_example

